<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"76d08c07193e5e50c448798450e312857734d0d3cec9bab4cd32f6947df42b43","plan_job_ref":"Job Environment Main - Plan #152 at https://github.com/jarrod-lowe/wildsea/actions/runs/10650917159","plan_out_hash":"449316007ef6c1f848b22ee3a7b0b9cb6a059b59c90131df4c2434a40c6bc319","plan_hash":"72252f3b8c93f227dbcd4c48caa378c8c5012189c7c0acee5bdac94214121e31","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
environment       = "primary"
saml_metadata_url = (sensitive value)
```
</details>
<details>
<summary>Plan: 3 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # module.wildsea.aws_appsync_function.function["fnGetGameWithToken"] will be created
+   resource "aws_appsync_function" "function" {
+       api_id           = "**************************"
+       arn              = (known after apply)
+       code             = <<-EOT
            // function/fnGetGameWithToken/appsync.ts
            import { util } from "@aws-appsync/utils";
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              const id = context.arguments.input.gameId;
              const key = {
                PK: "GAME#" + id,
                SK: "GAME"
              };
              return {
                operation: "GetItem",
                key: util.dynamodb.toMapValues(key)
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              if (context.result === null || context.result.joinToken !== context.arguments.input.joinToken) {
                util.error(
                  "Game not found or invalid token",
                  "AccessDeniedException"
                );
              }
              const identity = context.identity;
              if (identity.sub === context.result.fireflyUserId) {
                util.error("You cannot join your own game", "Conflict");
              }
              if (context.result.players?.includes(identity.sub)) {
                util.error("You are already a player in this game", "Conflict");
              }
              return context.result;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiYXBwc3luYy50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQSxTQUFTLFlBQTZDO0FBSS9DLFNBQVMsUUFDZCxTQUN3QjtBQUN4QixNQUFJLENBQUMsUUFBUSxVQUFVO0FBQ3JCLFNBQUssTUFBTSxnREFBMEQ7QUFBQSxFQUN2RTtBQUVBLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxTQUFTLEtBQUs7QUFDakIsU0FBSyxNQUFNLG1DQUE2QztBQUFBLEVBQzFEO0FBRUEsUUFBTSxLQUFLLFFBQVEsVUFBVSxNQUFNO0FBQ25DLFFBQU0sTUFBTTtBQUFBLElBQ1YsSUFBSSxVQUFVO0FBQUEsSUFDZCxJQUFJO0FBQUEsRUFDTjtBQUVBLFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLEtBQUssS0FBSyxTQUFTLFlBQVksR0FBRztBQUFBLEVBQ3BDO0FBQ0Y7QUFFTyxTQUFTLFNBQ2QsU0FDa0I7QUFDbEIsTUFBSSxRQUFRLE9BQU87QUFDakIsU0FBSyxNQUFNLFFBQVEsTUFBTSxTQUFTLFFBQVEsTUFBTSxNQUFNLFFBQVEsTUFBTTtBQUFBLEVBQ3RFO0FBRUEsTUFDRSxRQUFRLFdBQVcsUUFDbkIsUUFBUSxPQUFPLGNBQWMsUUFBUSxVQUFVLE1BQU0sV0FDckQ7QUFDQSxTQUFLO0FBQUEsTUFDSDtBQUFBLE1BQ0E7QUFBQSxJQUNGO0FBQUEsRUFDRjtBQUVBLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksU0FBUyxRQUFRLFFBQVEsT0FBTyxlQUFlO0FBQ2pELFNBQUssTUFBTSxpQ0FBMkMsVUFBVTtBQUFBLEVBQ2xFO0FBRUEsTUFBSSxRQUFRLE9BQU8sU0FBUyxTQUFTLFNBQVMsR0FBRyxHQUFHO0FBQ2xELFNBQUssTUFBTSx5Q0FBbUQsVUFBVTtBQUFBLEVBQzFFO0FBRUEsU0FBTyxRQUFRO0FBQ2pCOyIsCiAgIm5hbWVzIjogW10KfQo=
        EOT
+       data_source      = "Wildsea_primary"
+       function_id      = (known after apply)
+       function_version = (known after apply)
+       id               = (known after apply)
+       name             = "fnGetGameWithToken"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_function.function["fnJoinGame"] will be created
+   resource "aws_appsync_function" "function" {
+       api_id           = "**************************"
+       arn              = (known after apply)
+       code             = <<-EOT
            // function/fnJoinGame/appsync.ts
            import { util } from "@aws-appsync/utils";
            
            // environment.json
            var environment_default = { name: "primary" };
            
            // function/fnJoinGame/appsync.ts
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              const id = context.arguments.input.gameId;
              const timestamp = util.time.nowISO8601();
              const gameItem = {
                operation: "UpdateItem",
                table: "Wildsea-" + environment_default.name,
                key: util.dynamodb.toMapValues({
                  PK: "GAME#" + id,
                  SK: "GAME"
                }),
                update: {
                  expression: "ADD #players :player SET #updatedAt = :updatedAt",
                  expressionNames: {
                    "#players": "players",
                    "#updatedAt": "updatedAt"
                  },
                  expressionValues: {
                    ":player": { SS: [identity.sub] },
                    ":updatedAt": { S: timestamp }
                  }
                }
              };
              const playerItem = {
                operation: "PutItem",
                table: "Wildsea-" + environment_default.name,
                key: util.dynamodb.toMapValues({
                  PK: "GAME#" + id,
                  SK: "PLAYER#PC#" + identity.sub
                }),
                attributeValues: util.dynamodb.toMapValues({
                  gameId: id,
                  userId: identity.sub,
                  GSI1PK: "USER#" + identity.sub,
                  gameName: context.prev.result.gameName,
                  gameDescription: context.prev.result.gameDescription,
                  characterName: "Unnamed Character",
                  type: "CHARACTER",
                  createdAt: timestamp,
                  updatedAt: timestamp
                })
              };
              return {
                operation: "TransactWriteItems",
                transactItems: [gameItem, playerItem]
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              context.prev.result.joinToken = null;
              return context.prev.result;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiYXBwc3luYy50cyIsICIuLi8uLi9lbnZpcm9ubWVudC5qc29uIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBNkM7OztBQ0F0RCw0QkFBQyxNQUFPLFVBQVM7OztBREtWLFNBQVMsUUFBUSxTQUFxRDtBQUMzRSxNQUFJLENBQUMsUUFBUSxVQUFVO0FBQ3JCLFNBQUssTUFBTSxnREFBMEQ7QUFBQSxFQUN2RTtBQUVBLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxTQUFTLEtBQUs7QUFDakIsU0FBSyxNQUFNLG1DQUE2QztBQUFBLEVBQzFEO0FBRUEsUUFBTSxLQUFLLFFBQVEsVUFBVSxNQUFNO0FBQ25DLFFBQU0sWUFBWSxLQUFLLEtBQUssV0FBVztBQUV2QyxRQUFNLFdBQVc7QUFBQSxJQUNmLFdBQVc7QUFBQSxJQUNYLE9BQU8sYUFBYSxvQkFBWTtBQUFBLElBQ2hDLEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLFVBQVU7QUFBQSxNQUNkLElBQUk7QUFBQSxJQUNOLENBQUM7QUFBQSxJQUNELFFBQVE7QUFBQSxNQUNOLFlBQVk7QUFBQSxNQUNaLGlCQUFpQjtBQUFBLFFBQ2YsWUFBWTtBQUFBLFFBQ1osY0FBYztBQUFBLE1BQ2hCO0FBQUEsTUFDQSxrQkFBa0I7QUFBQSxRQUNoQixXQUFXLEVBQUUsSUFBSSxDQUFDLFNBQVMsR0FBRyxFQUFFO0FBQUEsUUFDaEMsY0FBYyxFQUFFLEdBQUcsVUFBVTtBQUFBLE1BQy9CO0FBQUEsSUFDRjtBQUFBLEVBQ0Y7QUFFQSxRQUFNLGFBQWE7QUFBQSxJQUNqQixXQUFXO0FBQUEsSUFDWCxPQUFPLGFBQWEsb0JBQVk7QUFBQSxJQUNoQyxLQUFLLEtBQUssU0FBUyxZQUFZO0FBQUEsTUFDN0IsSUFBSSxVQUFVO0FBQUEsTUFDZCxJQUFJLGVBQWUsU0FBUztBQUFBLElBQzlCLENBQUM7QUFBQSxJQUNELGlCQUFpQixLQUFLLFNBQVMsWUFBWTtBQUFBLE1BQ3pDLFFBQVE7QUFBQSxNQUNSLFFBQVEsU0FBUztBQUFBLE1BQ2pCLFFBQVEsVUFBVSxTQUFTO0FBQUEsTUFDM0IsVUFBVSxRQUFRLEtBQUssT0FBTztBQUFBLE1BQzlCLGlCQUFpQixRQUFRLEtBQUssT0FBTztBQUFBLE1BQ3JDLGVBQWU7QUFBQSxNQUNmLE1BQU07QUFBQSxNQUNOLFdBQVc7QUFBQSxNQUNYLFdBQVc7QUFBQSxJQUNiLENBQUM7QUFBQSxFQUNIO0FBRUEsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1gsZUFBZSxDQUFDLFVBQVUsVUFBVTtBQUFBLEVBQ3RDO0FBQ0Y7QUFFTyxTQUFTLFNBQ2QsU0FDa0I7QUFDbEIsTUFBSSxRQUFRLE9BQU87QUFDakIsU0FBSyxNQUFNLFFBQVEsTUFBTSxTQUFTLFFBQVEsTUFBTSxNQUFNLFFBQVEsTUFBTTtBQUFBLEVBQ3RFO0FBRUEsVUFBUSxLQUFLLE9BQU8sWUFBWTtBQUNoQyxTQUFPLFFBQVEsS0FBSztBQUN0QjsiLAogICJuYW1lcyI6IFtdCn0K
        EOT
+       data_source      = "Wildsea_primary"
+       function_id      = (known after apply)
+       function_version = (known after apply)
+       id               = (known after apply)
+       name             = "fnJoinGame"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_graphql_api.graphql will be updated in-place
!~  resource "aws_appsync_graphql_api" "graphql" {
        id                   = "tfiz6mnf2nhyzpzkwm554sir5q"
        name                 = "Wildsea-primary"
!~      schema               = <<-EOT
            scalar AWSTime
            scalar AWSDateTime
            scalar AWSTimestamp
            scalar AWSEmail
            scalar AWSJSON
            scalar AWSURL
            scalar AWSPhone
            scalar AWSIPAddress
            
            directive @aws_subscribe(mutations: [String!]!) on FIELD_DEFINITION
            directive @aws_auth(cognito_groups: [String!]!) on FIELD_DEFINITION
            directive @aws_api_key on FIELD_DEFINITION | OBJECT
            directive @aws_iam on FIELD_DEFINITION | OBJECT
            directive @aws_oidc on FIELD_DEFINITION | OBJECT
            directive @aws_cognito_user_pools(
              cognito_groups: [String!]
            ) on FIELD_DEFINITION | OBJECT
            
            type Mutation {
                createGame(input: CreateGameInput!): Game! @aws_cognito_user_pools
          +     joinGame(input: JoinGameInput!): Game! @aws_cognito_user_pools
            }
            
            type Query {
                getGame(id: ID!): Game! @aws_cognito_user_pools
          -     getGames: [GameSummary!] @aws_cognito_user_pools
          +     getGames: [PlayerSheetSummary!] @aws_cognito_user_pools
            }
            
            input CreateGameInput {
                name: String!
                description: String
            }
            
          + input JoinGameInput {
          +   gameId: ID!
          +   joinToken: ID!
          + }
          + 
            type Game @aws_cognito_user_pools {
              gameId: ID!
              gameName: String!
              gameDescription: String
              publicNotes: String
          -   privateNotes: String
              fireflyUserId: ID!
              players: [ID!]
          - #  playerSheets: [PlayerSheet!]!
          - #  shipSheet: ShipSheet
          - #  clocks: [Clock!]!
          +   joinToken: String
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
            }
            
          - type GameSummary @aws_cognito_user_pools {
          + type PlayerSheetSummary @aws_cognito_user_pools {
              gameId: ID!
              gameName: String!
              gameDescription: String!
              type: String!
            }
        EOT
        tags                 = {
            "Name" = "Wildsea-primary"
        }
#        (9 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # module.wildsea.aws_appsync_resolver.pipeline["joinGame"] will be created
+   resource "aws_appsync_resolver" "pipeline" {
+       api_id            = "**************************"
+       arn               = (known after apply)
+       field             = "joinGame"
+       id                = (known after apply)
+       kind              = "PIPELINE"
+       request_template  = jsonencode({})
+       response_template = "$util.toJson($ctx.result)"
+       type              = "Mutation"

+       pipeline_config {
+           functions = (known after apply)
        }
    }

  # module.wildsea.aws_appsync_resolver.resolver["createGame"] will be updated in-place
!~  resource "aws_appsync_resolver" "resolver" {
!~      code              = <<-EOT
            // mutation/createGame/appsync.ts
            import { util } from "@aws-appsync/utils";
            
            // environment.json
            var environment_default = { name: "primary" };
            
            // mutation/createGame/appsync.ts
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              const input = context.arguments.input;
              const id = util.autoId();
          +   const joinToken = util.autoId();
              const timestamp = util.time.nowISO8601();
              context.stash.record = {
                gameName: input.name,
                gameDescription: input.description,
                gameId: id,
                fireflyUserId: identity.sub,
                // players: no value yet
          +     joinToken,
                createdAt: timestamp,
                updatedAt: timestamp,
                type: "GAME"
              };
              const gameItem = {
                key: util.dynamodb.toMapValues({ PK: "GAME#" + id, SK: "GAME" }),
                operation: "PutItem",
                table: "Wildsea-" + environment_default.name,
                attributeValues: util.dynamodb.toMapValues(
                  context.stash.record
                )
              };
              const fireflyItem = {
                key: util.dynamodb.toMapValues({
                  PK: "GAME#" + id,
                  SK: "PLAYER#GM#" + identity.sub
                }),
                operation: "PutItem",
                table: "Wildsea-" + environment_default.name,
                attributeValues: util.dynamodb.toMapValues({
                  userId: identity.sub,
                  gameId: id,
                  gameName: input.name,
                  gameDescription: input.description,
          +       characterName: "Firefly",
                  GSI1PK: "USER#" + identity.sub,
                  createdAt: timestamp,
                  updatedAt: timestamp,
          -       type: "CHARACTER"
          +       type: "FIREFLY"
                })
              };
              return {
                operation: "TransactWriteItems",
                transactItems: [gameItem, fireflyItem]
              };
            }
            function response(context) {
              if (context.error) {
                util.appendError(context.error.message, context.error.type, context.result);
                return null;
              }
              return {
                PK: context.result.keys[0].PK,
                SK: context.result.keys[0].SK,
                gameName: context.stash.record.gameName,
                gameDescription: context.stash.record.gameDescription,
                gameId: context.stash.record.gameId,
                fireflyUserId: context.stash.record.fireflyUserId,
                createdAt: context.stash.record.createdAt,
                updatedAt: context.stash.record.updatedAt,
                type: context.stash.record.type
              };
            }
            export {
              request,
              response
            };
          - //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiYXBwc3luYy50cyIsICIuLi8uLi9lbnZpcm9ubWVudC5qc29uIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBNkM7OztBQ0F0RCw0QkFBQyxNQUFPLFVBQVM7OztBRGlCVixTQUFTLFFBQVEsU0FBdUQ7QUFDN0UsTUFBSSxDQUFDLFFBQVEsVUFBVTtBQUNyQixTQUFLLE1BQU0sZ0RBQTBEO0FBQUEsRUFDdkU7QUFFQSxRQUFNLFdBQVcsUUFBUTtBQUN6QixNQUFJLENBQUMsU0FBUyxLQUFLO0FBQ2pCLFNBQUssTUFBTSxtQ0FBNkM7QUFBQSxFQUMxRDtBQUVBLFFBQU0sUUFBUSxRQUFRLFVBQVU7QUFDaEMsUUFBTSxLQUFLLEtBQUssT0FBTztBQUN2QixRQUFNLFlBQVksS0FBSyxLQUFLLFdBQVc7QUFFdkMsVUFBUSxNQUFNLFNBQVM7QUFBQSxJQUNyQixVQUFVLE1BQU07QUFBQSxJQUNoQixpQkFBaUIsTUFBTTtBQUFBLElBQ3ZCLFFBQVE7QUFBQSxJQUNSLGVBQWUsU0FBUztBQUFBO0FBQUEsSUFFeEIsV0FBVztBQUFBLElBQ1gsV0FBVztBQUFBLElBQ1gsTUFBTTtBQUFBLEVBQ1I7QUFFQSxRQUFNLFdBQVc7QUFBQSxJQUNmLEtBQUssS0FBSyxTQUFTLFlBQVksRUFBRSxJQUFJLFVBQVUsSUFBSSxJQUFJLE9BQU8sQ0FBQztBQUFBLElBQy9ELFdBQVc7QUFBQSxJQUNYLE9BQU8sYUFBYSxvQkFBWTtBQUFBLElBQ2hDLGlCQUFpQixLQUFLLFNBQVM7QUFBQSxNQUM3QixRQUFRLE1BQU07QUFBQSxJQUNoQjtBQUFBLEVBQ0Y7QUFFQSxRQUFNLGNBQWM7QUFBQSxJQUNsQixLQUFLLEtBQUssU0FBUyxZQUFZO0FBQUEsTUFDN0IsSUFBSSxVQUFVO0FBQUEsTUFDZCxJQUFJLGVBQWUsU0FBUztBQUFBLElBQzlCLENBQUM7QUFBQSxJQUNELFdBQVc7QUFBQSxJQUNYLE9BQU8sYUFBYSxvQkFBWTtBQUFBLElBQ2hDLGlCQUFpQixLQUFLLFNBQVMsWUFBWTtBQUFBLE1BQ3pDLFFBQVEsU0FBUztBQUFBLE1BQ2pCLFFBQVE7QUFBQSxNQUNSLFVBQVUsTUFBTTtBQUFBLE1BQ2hCLGlCQUFpQixNQUFNO0FBQUEsTUFDdkIsUUFBUSxVQUFVLFNBQVM7QUFBQSxNQUMzQixXQUFXO0FBQUEsTUFDWCxXQUFXO0FBQUEsTUFDWCxNQUFNO0FBQUEsSUFDUixDQUFDO0FBQUEsRUFDSDtBQUVBLFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLGVBQWUsQ0FBQyxVQUFVLFdBQVc7QUFBQSxFQUN2QztBQUNGO0FBRU8sU0FBUyxTQUFTLFNBQStCO0FBQ3RELE1BQUksUUFBUSxPQUFPO0FBQ2pCLFNBQUssWUFBWSxRQUFRLE1BQU0sU0FBUyxRQUFRLE1BQU0sTUFBTSxRQUFRLE1BQU07QUFDMUUsV0FBTztBQUFBLEVBQ1Q7QUFDQSxTQUFPO0FBQUEsSUFDTCxJQUFJLFFBQVEsT0FBTyxLQUFLLENBQUMsRUFBRTtBQUFBLElBQzNCLElBQUksUUFBUSxPQUFPLEtBQUssQ0FBQyxFQUFFO0FBQUEsSUFDM0IsVUFBVSxRQUFRLE1BQU0sT0FBTztBQUFBLElBQy9CLGlCQUFpQixRQUFRLE1BQU0sT0FBTztBQUFBLElBQ3RDLFFBQVEsUUFBUSxNQUFNLE9BQU87QUFBQSxJQUM3QixlQUFlLFFBQVEsTUFBTSxPQUFPO0FBQUEsSUFDcEMsV0FBVyxRQUFRLE1BQU0sT0FBTztBQUFBLElBQ2hDLFdBQVcsUUFBUSxNQUFNLE9BQU87QUFBQSxJQUNoQyxNQUFNLFFBQVEsTUFBTSxPQUFPO0FBQUEsRUFDN0I7QUFDRjsiLAogICJuYW1lcyI6IFtdCn0K
          + //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiYXBwc3luYy50cyIsICIuLi8uLi9lbnZpcm9ubWVudC5qc29uIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBNkM7OztBQ0F0RCw0QkFBQyxNQUFPLFVBQVM7OztBREtWLFNBQVMsUUFBUSxTQUF1RDtBQUM3RSxNQUFJLENBQUMsUUFBUSxVQUFVO0FBQ3JCLFNBQUssTUFBTSxnREFBMEQ7QUFBQSxFQUN2RTtBQUVBLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxTQUFTLEtBQUs7QUFDakIsU0FBSyxNQUFNLG1DQUE2QztBQUFBLEVBQzFEO0FBRUEsUUFBTSxRQUFRLFFBQVEsVUFBVTtBQUNoQyxRQUFNLEtBQUssS0FBSyxPQUFPO0FBQ3ZCLFFBQU0sWUFBWSxLQUFLLE9BQU87QUFDOUIsUUFBTSxZQUFZLEtBQUssS0FBSyxXQUFXO0FBRXZDLFVBQVEsTUFBTSxTQUFTO0FBQUEsSUFDckIsVUFBVSxNQUFNO0FBQUEsSUFDaEIsaUJBQWlCLE1BQU07QUFBQSxJQUN2QixRQUFRO0FBQUEsSUFDUixlQUFlLFNBQVM7QUFBQTtBQUFBLElBRXhCO0FBQUEsSUFDQSxXQUFXO0FBQUEsSUFDWCxXQUFXO0FBQUEsSUFDWCxNQUFNO0FBQUEsRUFDUjtBQUVBLFFBQU0sV0FBVztBQUFBLElBQ2YsS0FBSyxLQUFLLFNBQVMsWUFBWSxFQUFFLElBQUksVUFBVSxJQUFJLElBQUksT0FBTyxDQUFDO0FBQUEsSUFDL0QsV0FBVztBQUFBLElBQ1gsT0FBTyxhQUFhLG9CQUFZO0FBQUEsSUFDaEMsaUJBQWlCLEtBQUssU0FBUztBQUFBLE1BQzdCLFFBQVEsTUFBTTtBQUFBLElBQ2hCO0FBQUEsRUFDRjtBQUVBLFFBQU0sY0FBYztBQUFBLElBQ2xCLEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLFVBQVU7QUFBQSxNQUNkLElBQUksZUFBZSxTQUFTO0FBQUEsSUFDOUIsQ0FBQztBQUFBLElBQ0QsV0FBVztBQUFBLElBQ1gsT0FBTyxhQUFhLG9CQUFZO0FBQUEsSUFDaEMsaUJBQWlCLEtBQUssU0FBUyxZQUFZO0FBQUEsTUFDekMsUUFBUSxTQUFTO0FBQUEsTUFDakIsUUFBUTtBQUFBLE1BQ1IsVUFBVSxNQUFNO0FBQUEsTUFDaEIsaUJBQWlCLE1BQU07QUFBQSxNQUN2QixlQUFlO0FBQUEsTUFDZixRQUFRLFVBQVUsU0FBUztBQUFBLE1BQzNCLFdBQVc7QUFBQSxNQUNYLFdBQVc7QUFBQSxNQUNYLE1BQU07QUFBQSxJQUNSLENBQUM7QUFBQSxFQUNIO0FBRUEsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1gsZUFBZSxDQUFDLFVBQVUsV0FBVztBQUFBLEVBQ3ZDO0FBQ0Y7QUFFTyxTQUFTLFNBQVMsU0FBK0I7QUFDdEQsTUFBSSxRQUFRLE9BQU87QUFDakIsU0FBSyxZQUFZLFFBQVEsTUFBTSxTQUFTLFFBQVEsTUFBTSxNQUFNLFFBQVEsTUFBTTtBQUMxRSxXQUFPO0FBQUEsRUFDVDtBQUNBLFNBQU87QUFBQSxJQUNMLElBQUksUUFBUSxPQUFPLEtBQUssQ0FBQyxFQUFFO0FBQUEsSUFDM0IsSUFBSSxRQUFRLE9BQU8sS0FBSyxDQUFDLEVBQUU7QUFBQSxJQUMzQixVQUFVLFFBQVEsTUFBTSxPQUFPO0FBQUEsSUFDL0IsaUJBQWlCLFFBQVEsTUFBTSxPQUFPO0FBQUEsSUFDdEMsUUFBUSxRQUFRLE1BQU0sT0FBTztBQUFBLElBQzdCLGVBQWUsUUFBUSxNQUFNLE9BQU87QUFBQSxJQUNwQyxXQUFXLFFBQVEsTUFBTSxPQUFPO0FBQUEsSUFDaEMsV0FBVyxRQUFRLE1BQU0sT0FBTztBQUFBLElBQ2hDLE1BQU0sUUFBUSxNQUFNLE9BQU87QUFBQSxFQUM3QjtBQUNGOyIsCiAgIm5hbWVzIjogW10KfQo=
        EOT
        id                = "tfiz6mnf2nhyzpzkwm554sir5q-Mutation-createGame"
#        (9 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.wildsea.aws_appsync_resolver.resolver["getGames"] will be updated in-place
!~  resource "aws_appsync_resolver" "resolver" {
!~      code              = <<-EOT
            // query/getGames/appsync.ts
            import { util } from "@aws-appsync/utils";
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              return {
                operation: "Query",
                index: "GSI1",
                query: {
                  expression: "#gsi1pk = :gsi1pk",
                  expressionNames: {
                    "#gsi1pk": "GSI1PK"
                  },
                  expressionValues: {
                    ":gsi1pk": util.dynamodb.toString("USER#" + identity.sub)
                  }
                }
              };
            }
            function response(context) {
              if (context.error) {
                util.appendError(context.error.message, context.error.type, context.result);
                return [];
              }
              return context.result.items;
            }
            export {
              request,
              response
            };
          - //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiYXBwc3luYy50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQSxTQUFTLFlBQTZDO0FBSS9DLFNBQVMsUUFBUSxTQUF3QztBQUM5RCxNQUFJLENBQUMsUUFBUSxVQUFVO0FBQ3JCLFNBQUssTUFBTSxnREFBMEQ7QUFBQSxFQUN2RTtBQUVBLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxTQUFTLEtBQUs7QUFDakIsU0FBSyxNQUFNLG1DQUE2QztBQUFBLEVBQzFEO0FBRUEsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1gsT0FBTztBQUFBLElBQ1AsT0FBTztBQUFBLE1BQ0wsWUFBWTtBQUFBLE1BQ1osaUJBQWlCO0FBQUEsUUFDZixXQUFXO0FBQUEsTUFDYjtBQUFBLE1BQ0Esa0JBQWtCO0FBQUEsUUFDaEIsV0FBVyxLQUFLLFNBQVMsU0FBUyxVQUFVLFNBQVMsR0FBRztBQUFBLE1BQzFEO0FBQUEsSUFDRjtBQUFBLEVBQ0Y7QUFDRjtBQUVPLFNBQVMsU0FBUyxTQUFpQztBQUN4RCxNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLFlBQVksUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLE1BQU0sUUFBUSxNQUFNO0FBQzFFLFdBQU8sQ0FBQztBQUFBLEVBQ1Y7QUFDQSxTQUFPLFFBQVEsT0FBTztBQUN4QjsiLAogICJuYW1lcyI6IFtdCn0K
          + //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiYXBwc3luYy50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQSxTQUFTLFlBQTZDO0FBSS9DLFNBQVMsUUFBUSxTQUF3QztBQUM5RCxNQUFJLENBQUMsUUFBUSxVQUFVO0FBQ3JCLFNBQUssTUFBTSxnREFBMEQ7QUFBQSxFQUN2RTtBQUVBLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxTQUFTLEtBQUs7QUFDakIsU0FBSyxNQUFNLG1DQUE2QztBQUFBLEVBQzFEO0FBRUEsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1gsT0FBTztBQUFBLElBQ1AsT0FBTztBQUFBLE1BQ0wsWUFBWTtBQUFBLE1BQ1osaUJBQWlCO0FBQUEsUUFDZixXQUFXO0FBQUEsTUFDYjtBQUFBLE1BQ0Esa0JBQWtCO0FBQUEsUUFDaEIsV0FBVyxLQUFLLFNBQVMsU0FBUyxVQUFVLFNBQVMsR0FBRztBQUFBLE1BQzFEO0FBQUEsSUFDRjtBQUFBLEVBQ0Y7QUFDRjtBQUVPLFNBQVMsU0FBUyxTQUF3QztBQUMvRCxNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLFlBQVksUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLE1BQU0sUUFBUSxNQUFNO0FBQzFFLFdBQU8sQ0FBQztBQUFBLEVBQ1Y7QUFDQSxTQUFPLFFBQVEsT0FBTztBQUN4QjsiLAogICJuYW1lcyI6IFtdCn0K
        EOT
        id                = "tfiz6mnf2nhyzpzkwm554sir5q-Query-getGames"
#        (9 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.wildsea.aws_iam_policy.graphql_datasource will be updated in-place
!~  resource "aws_iam_policy" "graphql_datasource" {
        id               = "arn:aws:iam::021891603679:policy/Wildsea-primary-graphql-datasource"
        name             = "Wildsea-primary-graphql-datasource"
!~      policy           = jsonencode(
!~          {
!~              Statement = [
!~                  {
!~                      Action   = [
!~                          "dynamodb:UpdateutItem" -> "dynamodb:UpdateItem",
                            "dynamodb:Query",
#                            (3 unchanged elements hidden)
                        ]
#                        (2 unchanged attributes hidden)
                    },
                ]
#                (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "Name" = "Wildsea-primary"
        }
#        (7 unchanged attributes hidden)
    }

Plan: 3 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #152](https://github.com/jarrod-lowe/wildsea/actions/runs/10650917159)